'''
本文件用于定义全局变量
'''
#物品
# 必需品
need1=['A','B','C']
# 非必需品
need2 = ['a','b']
need = need1 + need2
产品列表 = need
# 配方
pf={
    'A' : [5,6,9,5,6],
    'B' : [1,2,3,4,5],
    'C' : [1,2,3,4,5],
    'a' : [1,2,3,4,5],
    'b' : [1,2,3,4,5],
    'c' : [1,2,3,4,5],
    'd' : [1,2,3,4,5]
}




################################################
### 全局变量 ###################################
单位列表 =[]
buy ={} # 今日购买
out = {}
momeny ={}
price = {}
units=[]
store={}       # 总库存
信息表=[['名称','类型','储量','产量','资金','今日购买','今日价格','购买花费','人工','今日卖出','净利润']]
for i in 产品列表:
    buy.update({i:0})
    out.update({i:0})
    momeny.update({i:0})
    price.update({i:0})
    store.update({i:0})

